notes/meeting_2021jan02.md
- [meeting notes January 02, 2022](#orgd0f33cc)
  - [the raku study group](#org7bc8425)
    - [<Raku pun>](#orgc9c6799)
  - [usual links](#org6ab5ce2)
    - [<https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022jan02.md>](#orga7bbe60)
    - [<https://github.com/doomvox/raku-study/bin/2022jan02>](#org6888283)
  - [topicettes](#org13f26b2)
    - [new work on thread libraries for perl5](#orgb2b369d)
    - [sean mcaffee, div doesn't coerce to numeric?](#orgfb5ccfd)
    - [idea for a new utility package](#orgacab18c)
    - [phasers, perl6-users discussion](#org5195795)
    - [deepmap, stackoverflow question](#orgb3db678)
    - [subdivide document into even chunks (stackoverflow)](#org633880d)
    - [brad gilbert, delayed 1/0 errors](#orgfa7868a)
    - [jonathan worthington, cro-ing](#org21f7001)
    - [alan recommends youtube channel "ada fruit"](#org0aa17a7)
  - [announcments](#orgfe1645f)
    - [January 6th: svlug: I'll be talking about Raku](#org3a25ce2)
    - [January 16th: next meeting](#orgfd7a742)


<a id="orgd0f33cc"></a>

# meeting notes January 02, 2022


<a id="org7bc8425"></a>

## the raku study group


<a id="orgc9c6799"></a>

### <Raku pun>


<a id="org6ab5ce2"></a>

## usual links


<a id="orga7bbe60"></a>

### <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022jan02.md>


<a id="org6888283"></a>

### <https://github.com/doomvox/raku-study/bin/2022jan02>


<a id="org13f26b2"></a>

## topicettes


<a id="orgb2b369d"></a>

### new work on thread libraries for perl5

1.  <https://metacpan.org/pod/Thread::Csp>


<a id="orgfb5ccfd"></a>

### sean mcaffee, div doesn't coerce to numeric?

1.  <https://www.nntp.perl.org/group/perl.perl6.users/2021/12/msg10343.html>

2.  maybe a feature: '3' => 3 is okay, but is 3.4 => 3?


<a id="orgacab18c"></a>

### idea for a new utility package

1.  <https://raku-advent.blog/2021/12/11/unix_philosophy_without_leftpad_part2/>

2.  wants to name it "\_" or "lowbar"

    1.  because calling it "util" would be confusing
    
    2.  very specific rules for the package without any ideas of what to put in it
    
    3.  complicated thinking justifying the underlying philosophy, based on observations of programmer behavior


<a id="org5195795"></a>

### phasers, perl6-users discussion

1.  my access to the list is mangled, I don't get mail from it

2.  the archived form of this discussion is mangled

    1.  (refers to a Yary comment that isn't there)
    
        1.  <https://www.nntp.perl.org/group/perl.perl6.users/2021/12/msg10332.html>
        
        2.  <https://github.com/Raku/problem-solving/issues/308>


<a id="orgb3db678"></a>

### deepmap, stackoverflow question

1.  <https://stackoverflow.com/questions/70414736/immutable-uncontainerized-elements-in-arrays-created-by-deepmap>


<a id="org633880d"></a>

### subdivide document into even chunks (stackoverflow)

1.  <https://stackoverflow.com/questions/61875715/split-string-to-fixed-length-chunks-and-write-in-separate-line-in-raku>


<a id="orgfa7868a"></a>

### brad gilbert, delayed 1/0 errors

1.  <https://stackoverflow.com/questions/67980761/raku-attempt-to-divide-by-zero-when-coercing-rational-to-str/67987507#67987507>


<a id="org21f7001"></a>

### jonathan worthington, cro-ing

1.  <https://raku-advent.blog/2021/12/19/let-it-cro/>


<a id="org0aa17a7"></a>

### alan recommends youtube channel "ada fruit"


<a id="orgfe1645f"></a>

## announcments


<a id="org3a25ce2"></a>

### January 6th: svlug: I'll be talking about Raku


<a id="orgfd7a742"></a>

### January 16th: next meeting
